Tekla.Structures.Drawing.SectionMarkBase
The SectionMarkBase class is a base class for both the SectionMark class and the CurvedSectionMark class.

Tekla.Structures.Drawing.SectionMarkBase.LeftPoint
The starting point of the left symbol of the section mark.

Tekla.Structures.Drawing.SectionMarkBase.RightPoint
The starting point of the right symbol of the section mark.

Tekla.Structures.Drawing.SectionMarkBase.Attributes
The attributes for the section mark.

Tekla.Structures.Drawing.SectionMarkBase.DbOperation(Tekla.Structures.DrawingInternal.QueryTypeEnum,Tekla.Structures.DrawingInternal.dotGrSectionMark_t@)
Call TS and perform database operation specified in OperationType.

Tekla.Structures.Drawing.SectionMarkBase.Delete
Deletes the section mark from the current drawing database.
Returns: True on success.

Tekla.Structures.Drawing.SectionMarkBase.Modify
Modifies the section mark in the current drawing database.
Returns: True on success.

Tekla.Structures.Drawing.SectionMarkBase.Insert
Inserts the section mark into the current drawing database.
Returns: True on success.

Tekla.Structures.Drawing.SectionMarkBase.Select
Selects the section mark from the current drawing database.
Returns: True on success.

Tekla.Structures.Drawing.SectionMarkBase.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.